adress = ["Мередианная 10 В1010","Ямашева 78 4п в7804","Мусина 49 4п в4904","Чистопольская 71А 7п в2602","Четаева 54 *88#","Магелан#234#","Ямашева 102а В1444","Нигматуллина 5 12345в","Ямашева 30 в888","Ямашева 78 4п в7804","Меридианная_30_5п_0305","Дементьева_28к1_#4230","Беломорская_106_В5В4253","Восстания_74_В1980","Япеева 10 (калитка *789#n) В 2685","Право-булачная 47 (код от ворот 4747)","Декабристов 115 Б1979","Шамиля Усманова 6 в5407в","Чистопольская 22 1235","Декабристов 101 в5407в","Чистопольская 62 в2802","Маршала Чуйкова 59В (калитка 3478#)","Сабан 1 в1105","Галимджана Барунди 4 (калитка 2906#)","Четаева 25 2501","Пушкина 5/43 4589#","Портовая 37вк1 #4230","Портовая 37к1 #1234","Зинина 7 В3717","Япеева 10 786#","Волкова 70 7016#","Федосей 50 4273#","Горсоветская 25 В8794","Чистопольская 85 0000","Коммунаров 2 В65535","Дежнёва 2к2 В1979","Ягодинская 25 8под в466в4568","Сулеймановой 3 под5 #757","Юго-Западная 9а В1102","Горсоветская 33 742# - Калитка #423 - Домофон","Юго-Западная 36 В0810","Горсоветская 17к1 В1979","Декабристов 125 В1979","Юго-Западная 37 В3285","Дружинная 8 В9876","Вахитова 8 67#890","Комсомольская 2 Д2010Д","Пролетарская 21 в5407","Сулеймановой 5 п1 #234","Сулеймановой 5 п2 67#890","Вахитова 8 п3 *567#890","Декабристов 83 п4 В127в4526","Горсоветская 17к1 в2611087","Шоссейная 17 п3  в2003","Ягодинская 35 п1 В110992","Дружинная 6 в1234","Салимжанова 21 кал вв3917 3п в2103","Дубравная 17 00000в","Заслонова 17 3п в2011","Толстого 16а 2п #0342","Пп210а п4 в203116","Серова 35 3п. В2784","Голубятникова1 3п В0103","Академика Губкина 52А 2п В5В4253","Восстания 121А 1п 1811","Восстания 15 В9999","Маршала Чуйкова 31 2п Б3120"]

adress.sort()
print('\n'.join(adress))







